git/notes_gitlab.org
#+SETUPFILE: ~/mynotes/org2html/org-theme-collection/theme2.setup
#  This file is the notese of Coreshef- Linux Tutorial

#+TITLE: GitLab
#+AUTHOR:    D Karthik
#+OPTIONS: num:nil
# +OPTIONS: ^:nil p:t
# +OPTIONS: toc:nil  Timestamp: nil toc:nil date:nil author:nil
#+OPTIONS: broken-links:t

#+HTML_HEAD: <link rel="icon" type="image/png" href="https://deepalgorithms.in/images/favicon.png">
#+Setupfile: ~/mynotes/org2html/org-theme-collection/theme-readtheorg.setup


[[https://www.youtube.com/watch?v=8aV5AxJrHDg][Learn GitLab in 3 Hours | GitLab Complete Tutorial For Beginners]] : Need to take snapshot on merge request and pull request

* Price comparision
IMP : NO.OF COLLABORATOR : =UNLIMITED= source : https://about.gitlab.com/blog/2019/01/07/github-offering-free-private-repos-for-up-to-three-collaborators/

| Free functionality        | GitLab      | GitHub                                 |
|---------------------------+-------------+----------------------------------------|
| Private repositories      | Yes         | Yes                                    |
| Number of collaborators   | =Unlimited= | 3                                      | 
| Wiki                      | Yes         | No (public or paid only)               |
| Pages                     | Yes         | Yes-need to check                      |
| Capacity                  | 10GB        | 1GB                                    |
| Indicates who is paying   | No          | Yes                                    |
| Free CI                   | 2,000 min.  | Maybe a free tier for Actions on Azure |
| Entire DevOps lifecycle   | Yes         | No                                     |
| Location of the repo      | Anywhere    | Not in groups/orgs                     |
| API concurrent rate limit | 36000       | 5000                                   |


| feature                          | Free        | Premium            | Ultimate            |
|                                  | gitlab OR   | $19 per user/month | $ 99 per user/month |
|                                  | self-host   | annual: $228       | annually: $1188     |
|----------------------------------+-------------+--------------------+---------------------|
| CI/CD minutes per month          | 400 minutes | 10,000 minutes     | 50,000 minutes      |
| Storage                          | 5GB         | 50GB               | 250GB               |
| Transfer per month               | 10GB        | 100GB              | 500GB               |
| CI/CD mints per month            | 400mints    | 10K mints          | 50K mints           |
| Support                          | No          | Yes                | Yes                 |
| =Enterprise agile planning=      | No          | Yes                | Yes                 |
|----------------------------------+-------------+--------------------+---------------------|
| Open Source - MIT License        | Yes         | Yes                | Yes                 |
| Bring your own GitLab CI runners | Yes         | Yes                | Yes                 |
| Includes free static websites    | Yes         | Yes                | Yes                 |
| Faster code reviews              | No          | Yes                | Yes                 |
| Advanced CI/CD                   | No          | Yes                | Yes                 |
| Release controls                 | No          | Yes                | Yes                 |
| Self-managed reliability         | No          | Yes                | Yes                 |

Other Price
CI/CD Minutes : $10 per 10,000 minutes
Storage       : $60 per 10GB & 20Gb (transfer per month )
Enterprise agile planning : [[https://www.youtube.com/watch?v=cVC8bcV8zsQ][Youtube-link:GitLab Agile Project Management Demo]]

-  Can i add more user to my Subscription ?
  - Yes. You have a few options. You can add users to your subscription any time during the subscription period. You can log in to your account via the GitLab Customers Portal and add more seats or contact sales for a quote.
  - In either case, the cost will be prorated from the date of quote/purchase through the end of the subscription period. You may also pay for the additional licenses per our true-up model.
  -  
* Srum Master (Jira )
* Moving to Gitlab (self host/ gitlab-host) 
* Gitlab
** Gitlab Terminology
*** Gitlab Group :
  - Description:
      - allow you to o manage settings across multiple project
      - logically categorize multiple users or projects
      - cross projecg view (merge request)
  - Activity
  - Labels =LABLES IMP FOR PROJGET MANAGEMENT=
  - Members :
      - add/remove members
      - access permission : owner, maintainer, developer, repoter, guest
        - =NOTE: owner, mainter, developer have permission to read, write,create, delete the project but not write=
        - =NOTE: repoter and guset have permission to read but not write=
  - Issuse :
      - List
      - Board : =Kanban=
      - Milestone
  - Merge Request
  - CI/CD : =Runner= : set runner for group
  - Setting :
      - General: =Transfer group=
        
