git/notes_gitlab.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-16 Thu 11:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GitLab</title>
<meta name="author" content="D Karthik" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/png" href="https://deepalgorithms.in/assets/icons/favicon.png">
<link rel="stylesheet" type="text/css" href="readtheorg-htmlize.css"/>
<link rel="stylesheet" type="text/css" href="readtheorg.css"/>
<link rel="icon" type="image/png" href="https://deepalgorithms.in/images/favicon.png">
<link rel="icon" type="image/png" href="https://deepalgorithms.in/assets/icons/favicon.png">
<link rel="stylesheet" type="text/css" href="readtheorg-htmlize.css"/>
<link rel="stylesheet" type="text/css" href="readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">GitLab</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbf64b50">Price comparision</a></li>
<li><a href="#orgd2a16fb">Srum Master (Jira )</a></li>
<li><a href="#org7f90b02">Moving to Gitlab (self host/ gitlab-host)</a></li>
<li><a href="#org543fe24">Gitlab</a>
<ul>
<li><a href="#org2d361e7">Gitlab Terminology</a>
<ul>
<li><a href="#org339b908">Gitlab Group :</a></li>
<li><a href="#org048af67">Gitlab Project :</a></li>
<li><a href="#orgead6a00">Issuse :</a></li>
</ul>
</li>
<li><a href="#orgae65a9c"><span class="todo TODO">TODO</span> Branching Strategies</a></li>
<li><a href="#org320479e">Host html in gitlab</a></li>
<li><a href="#org449d74e">Group Member access Permission</a></li>
</ul>
</li>
<li><a href="#org74eebb9">Remote access</a></li>
<li><a href="#orgf8ca322">FAQ</a>
<ul>
<li><a href="#orgcd1a485">Create static html and host in gitlab</a>
<ul>
<li><a href="#org50f12c8">Install Gitlab Runner in local OS for gitlab project or group</a></li>
<li><a href="#org1e2bce4">Create static html page using gitlab</a></li>
</ul>
</li>
<li><a href="#org48e6b31">how-to-change-the-project-owner-in-gitlab</a></li>
</ul>
</li>
<li><a href="#orgf963325">NEXT [#A] GitLab Project Management: How to use Issue, Labels, and Boards</a></li>
<li><a href="#org60667f5">Gitlab Issuse</a></li>
<li><a href="#orgab56b43">Gitlab Member Permissions : ower, maintainer, developer, reporter, guest</a></li>
<li><a href="#orgdd0cdd1">Gitlab Lables :</a>
<ul>
<li><a href="#org5ce02d7">Lable : priortiy label</a></li>
</ul>
</li>
<li><a href="#org0a9d809"></a></li>
<li><a href="#org50dbe1d">Git</a></li>
<li><a href="#orgcb01e67">Git Issuse Board</a></li>
<li><a href="#orgcd689a2">Git Milestone</a></li>
<li><a href="#org72ffa75"><span class="todo TODO">TODO</span> Gitlab jira intergration</a></li>
<li><a href="#org40c2d65"><span class="todo TODO">TODO</span> Gitlab Issuse &lt;board&gt; kanban</a></li>
<li><a href="#org60dea4d">Git Issuse and Milestone</a></li>
</ul>
</div>
</div>
<p>
<a href="https://www.youtube.com/watch?v=8aV5AxJrHDg">Learn GitLab in 3 Hours | GitLab Complete Tutorial For Beginners</a> : Need to take snapshot on merge request and pull request
</p>

<div id="outline-container-orgbf64b50" class="outline-2">
<h2 id="orgbf64b50">Price comparision</h2>
<div class="outline-text-2" id="text-orgbf64b50">
<p>
IMP : NO.OF COLLABORATOR : <code>UNLIMITED</code> source : <a href="https://about.gitlab.com/blog/2019/01/07/github-offering-free-private-repos-for-up-to-three-collaborators/">https://about.gitlab.com/blog/2019/01/07/github-offering-free-private-repos-for-up-to-three-collaborators/</a>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Free functionality</th>
<th scope="col" class="org-left">GitLab</th>
<th scope="col" class="org-left">GitHub</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Private repositories</td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Number of collaborators</td>
<td class="org-left"><code>Unlimited</code></td>
<td class="org-left">3</td>
</tr>

<tr>
<td class="org-left">Wiki</td>
<td class="org-left">Yes</td>
<td class="org-left">No (public or paid only)</td>
</tr>

<tr>
<td class="org-left">Pages</td>
<td class="org-left">Yes</td>
<td class="org-left">Yes-need to check</td>
</tr>

<tr>
<td class="org-left">Capacity</td>
<td class="org-left">10GB</td>
<td class="org-left">1GB</td>
</tr>

<tr>
<td class="org-left">Indicates who is paying</td>
<td class="org-left">No</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Free CI</td>
<td class="org-left">2,000 min.</td>
<td class="org-left">Maybe a free tier for Actions on Azure</td>
</tr>

<tr>
<td class="org-left">Entire DevOps lifecycle</td>
<td class="org-left">Yes</td>
<td class="org-left">No</td>
</tr>

<tr>
<td class="org-left">Location of the repo</td>
<td class="org-left">Anywhere</td>
<td class="org-left">Not in groups/orgs</td>
</tr>

<tr>
<td class="org-left">API concurrent rate limit</td>
<td class="org-left">36000</td>
<td class="org-left">5000</td>
</tr>
</tbody>
</table>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">feature</th>
<th scope="col" class="org-left">Free</th>
<th scope="col" class="org-left">Premium</th>
<th scope="col" class="org-left">Ultimate</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">gitlab OR</th>
<th scope="col" class="org-left">$19 per user/month</th>
<th scope="col" class="org-left">$ 99 per user/month</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">self-host</th>
<th scope="col" class="org-left">annual: $228</th>
<th scope="col" class="org-left">annually: $1188</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">CI/CD minutes per month</td>
<td class="org-left">400 minutes</td>
<td class="org-left">10,000 minutes</td>
<td class="org-left">50,000 minutes</td>
</tr>

<tr>
<td class="org-left">Storage</td>
<td class="org-left">5GB</td>
<td class="org-left">50GB</td>
<td class="org-left">250GB</td>
</tr>

<tr>
<td class="org-left">Transfer per month</td>
<td class="org-left">10GB</td>
<td class="org-left">100GB</td>
<td class="org-left">500GB</td>
</tr>

<tr>
<td class="org-left">CI/CD mints per month</td>
<td class="org-left">400mints</td>
<td class="org-left">10K mints</td>
<td class="org-left">50K mints</td>
</tr>

<tr>
<td class="org-left">Support</td>
<td class="org-left">No</td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left"><code>Enterprise agile planning</code></td>
<td class="org-left">No</td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Open Source - MIT License</td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Bring your own GitLab CI runners</td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Includes free static websites</td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Faster code reviews</td>
<td class="org-left">No</td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Advanced CI/CD</td>
<td class="org-left">No</td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Release controls</td>
<td class="org-left">No</td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Self-managed reliability</td>
<td class="org-left">No</td>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
</tr>
</tbody>
</table>

<p>
Other Price
CI/CD Minutes : $10 per 10,000 minutes
Storage       : $60 per 10GB &amp; 20Gb (transfer per month )
Enterprise agile planning : <a href="https://www.youtube.com/watch?v=cVC8bcV8zsQ">Youtube-link:GitLab Agile Project Management Demo</a>
</p>

<ul class="org-ul">
<li>Can i add more user to my Subscription ?
<ul class="org-ul">
<li>Yes. You have a few options. You can add users to your subscription any time during the subscription period. You can log in to your account via the GitLab Customers Portal and add more seats or contact sales for a quote.</li>
<li>In either case, the cost will be prorated from the date of quote/purchase through the end of the subscription period. You may also pay for the additional licenses per our true-up model.</li>
<li></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgd2a16fb" class="outline-2">
<h2 id="orgd2a16fb">Srum Master (Jira )</h2>
</div>
<div id="outline-container-org7f90b02" class="outline-2">
<h2 id="org7f90b02">Moving to Gitlab (self host/ gitlab-host)</h2>
</div>
<div id="outline-container-org543fe24" class="outline-2">
<h2 id="org543fe24">Gitlab</h2>
<div class="outline-text-2" id="text-org543fe24">
</div>
<div id="outline-container-org2d361e7" class="outline-3">
<h3 id="org2d361e7">Gitlab Terminology</h3>
<div class="outline-text-3" id="text-org2d361e7">
</div>
<div id="outline-container-org339b908" class="outline-4">
<h4 id="org339b908">Gitlab Group :</h4>
<div class="outline-text-4" id="text-org339b908">
<ul class="org-ul">
<li>Description:
<ul class="org-ul">
<li>allow you to o manage settings across multiple project</li>
<li>logically categorize multiple users or projects</li>
<li>cross projecg view (merge request)</li>
</ul></li>
<li>Activity</li>
<li>Labels <code>LABLES IMP FOR PROJGET MANAGEMENT</code></li>
<li>Members :
<ul class="org-ul">
<li>add/remove members</li>
<li>access permission : owner, maintainer, developer, repoter, guest
<ul class="org-ul">
<li><code>NOTE: owner, mainter, developer have permission to read, write,create, delete the project but not write</code></li>
<li><code>NOTE: repoter and guset have permission to read but not write</code></li>
</ul></li>
</ul></li>
<li>Issuse :
<ul class="org-ul">
<li>List</li>
<li>Board : <code>Kanban</code></li>
<li>Milestone</li>
</ul></li>
<li>Merge Request</li>
<li>CI/CD : <code>Runner</code> : set runner for group</li>
<li>Setting :
<ul class="org-ul">
<li>General: <code>Transfer group</code></li>
</ul></li>
</ul>
</div>
</div>
