git/notes_gitlab.org
*** Gitlab Project :
    - description:
      - git reposiotory
      - Build CI/CD
      - ISSUSE tracking
      - Collaboration Tools
      - =NOTE: YOUR SOFTWARE DEVELOPMENT WORKFLOW BEGINS WITH ISSUSE=
    - Project Info :
      - Activity
      - Label
      - Member
    - git Reposiotory
      - Files
      - Commits
      - Branches
      - Tags
      - Contributors
      - Graph
      - Compare
    - Issuse :
      - List
      - Board : =Kanban=
      - Milestone   =gantt chart=   
    - CI/CD :
      - Pipeline
      - Editor
      - Jobs
      - Schedule
    - Merge request :
    - Wiki
    - Setting
      - General
      - Pages
*** Issuse : 
    - Description:
      - way to track work (git project)
      - report bugs
      - request *new features* (there are many feature ) 
      - questions and more
    - List
    - Board
    - Milestone         


** TODO Branching Strategies
- git flow
- github
- gitlab     

** Host html in gitlab

** Group Member access Permission
*owner Access* - add/remove members , add/remove permission to members, create pages, wiki pages read/write
*maintainer Access*   - createe pages, wiki pages, read/write, create projects and group , cann't delete any project/group
*developer Access* - read/write
*reporter  Access* - read
*Guest Access* - read 
https://docs.gitlab.com/ee/user/permissions.html
* Remote access
- Personal Access Token
- SSH configuration

- *gitlab/User Setting* : 
    - Personal Access Token
    - SSH Key
      
* FAQ
** Create static html and host in gitlab  
*** Install Gitlab Runner in local OS for gitlab project or group

https://docs.gitlab.com/runner/install/

[[https://www.youtube.com/watch?v=G8ZONHOTAQk][youtube link:]]


Note: in project or github repo go Setting/ CI/CD/ Runner
install Runner 
# # Get the command in gitlab:<group-name>/<CI/CD>/Runner
- Click Follow the [[insall and register][installation and registration instructions]] to set up a runner. or
- Click : [[ad][Register a group runner]]  
#+begin_src sh
# Download the binary for your system
sudo curl -L --output /usr/local/bin/gitlab-runner https://gitlab-runner-downloads.s3.amazonaws.com/latest/binaries/gitlab-runner-linux-amd64

# Give it permission to execute
sudo chmod +x /usr/local/bin/gitlab-runner

# Create a GitLab Runner user
sudo useradd --comment 'GitLab Runner' --create-home gitlab-runner --shell /bin/bash

# Install and run as a service
sudo gitlab-runner install --user=gitlab-runner --working-directory=/home/gitlab-runner
sudo gitlab-runner start

# Command to register runner
# NOTE : GITLAB will generate the token 
sudo gitlab-runner register --url https://gitlab.com/ --registration-token GR1348941AxBu37cTfuz9eH48gyD9 
#+end_src
*** Create static html page using gitlab
https://www.youtube.com/watch?v=kvZ9teaA5zI
** how-to-change-the-project-owner-in-gitlab

https://stackoverflow.com/questions/21579693/how-to-change-the-project-owner-in-gitlab

Because one user cannot "own" another namespace (not even admins), the only option to set up a scenario where two users own the same namespace is with a group. Perform the following steps to accomplish this.

- Create a new group.
- Add the user that you want to transfer your project to as an owner member of that group.
- Transfer your project to that group (a namespace you manage because you are an owner).
- Login as the other user, then transfer the group project to the "other user" namespace.

At this point you will be left as a master in the project. You can now remove yourself from the project entirely if desired.




* NEXT [#A] GitLab Project Management: How to use Issue, Labels, and Boards
https://www.youtube.com/watch?v=J2u7OqBA_aQ
GitLab Project Management: How to use Issue, Labels, and Boards

* Gitlab Issuse
https://www.youtube.com/watch?v=YshvUGgF_3o

issuse template
https://www.youtube.com/watch?v=ObNWS3trqIY
https://www.youtube.com/watch?v=UPsCXqxxJUA
* Gitlab Member Permissions : ower, maintainer, developer, reporter, guest
- access permission : owner, maintainer, developer, repoter, guest
* Gitlab Lables :
https://docs.gitlab.com/ee/user/project/labels.html

Create a lable : [[https://www.youtube.com/watch?v=YshvUGgF_3o][Newbostan:Git Tutorial - 23 - GitHub Issues and Labels]]

https://gitlab.com/gitlab-org/quality/triage-reports/-/labels?page=7
Use scoped labels in GitLab 11.10 for custom fields and custom workflows


[[https://www.youtube.com/watch?v=4BCBby6du3c][Use scoped labels in GitLab 11.10 for custom fields and custom workflows]]
This(Scope label) is only avaible for premium tire 

https://www.youtube.com/watch?v=35V2FJX4sAs
Demo - Service Desk 

** Lable : priortiy label
- Lable issue with priority
- Standard Planing Board
    
* 
* Git 
* Git Issuse Board

* Git Milestone
https://www.youtube.com/watch?v=ZBjCmOYNb5Q
Gitlab Project Management: Sprints, User Stories, and Tasks

https://www.youtube.com/watch?v=tv4UM1ruQRs

https://www.youtube.com/watch?v=enMumwvLAug
Introduction to GitLab Workflow
* TODO Gitlab jira intergration
https://www.youtube.com/watch?v=p56zrZtrhQE

GitLab-Jira Integration - Jira Automation Triggers

https://www.youtube.com/watch?v=DhAGIg04uaQ

GitLab-Jira Integration - Jira Deployments
https://www.youtube.com/watch?v=i_Gzxp8A2l4

* TODO Gitlab Issuse <board> kanban
https://www.youtube.com/watch?v=CiolDtBIOA0
 GitLab issue boards demo

