git/notes_gitlab.html

<div id="outline-container-org048af67" class="outline-4">
<h4 id="org048af67">Gitlab Project :</h4>
<div class="outline-text-4" id="text-org048af67">
<ul class="org-ul">
<li>description:
<ul class="org-ul">
<li>git reposiotory</li>
<li>Build CI/CD</li>
<li>ISSUSE tracking</li>
<li>Collaboration Tools</li>
<li><code>NOTE: YOUR SOFTWARE DEVELOPMENT WORKFLOW BEGINS WITH ISSUSE</code></li>
</ul></li>
<li>Project Info :
<ul class="org-ul">
<li>Activity</li>
<li>Label</li>
<li>Member</li>
</ul></li>
<li>git Reposiotory
<ul class="org-ul">
<li>Files</li>
<li>Commits</li>
<li>Branches</li>
<li>Tags</li>
<li>Contributors</li>
<li>Graph</li>
<li>Compare</li>
</ul></li>
<li>Issuse :
<ul class="org-ul">
<li>List</li>
<li>Board : <code>Kanban</code></li>
<li>Milestone   <code>gantt chart</code></li>
</ul></li>
<li>CI/CD :
<ul class="org-ul">
<li>Pipeline</li>
<li>Editor</li>
<li>Jobs</li>
<li>Schedule</li>
</ul></li>
<li>Merge request :</li>
<li>Wiki</li>
<li>Setting
<ul class="org-ul">
<li>General</li>
<li>Pages</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgead6a00" class="outline-4">
<h4 id="orgead6a00">Issuse :</h4>
<div class="outline-text-4" id="text-orgead6a00">
<ul class="org-ul">
<li>Description:
<ul class="org-ul">
<li>way to track work (git project)</li>
<li>report bugs</li>
<li>request <b>new features</b> (there are many feature )</li>
<li>questions and more</li>
</ul></li>
<li>List</li>
<li>Board</li>
<li>Milestone</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgae65a9c" class="outline-3">
<h3 id="orgae65a9c"><span class="todo TODO">TODO</span> Branching Strategies</h3>
<div class="outline-text-3" id="text-orgae65a9c">
<ul class="org-ul">
<li>git flow</li>
<li>github</li>
<li>gitlab</li>
</ul>
</div>
</div>

<div id="outline-container-org320479e" class="outline-3">
<h3 id="org320479e">Host html in gitlab</h3>
</div>

<div id="outline-container-org449d74e" class="outline-3">
<h3 id="org449d74e">Group Member access Permission</h3>
<div class="outline-text-3" id="text-org449d74e">
<p>
<b>owner Access</b> - add/remove members , add/remove permission to members, create pages, wiki pages read/write
<b>maintainer Access</b>   - createe pages, wiki pages, read/write, create projects and group , cann't delete any project/group
<b>developer Access</b> - read/write
<b>reporter  Access</b> - read
<b>Guest Access</b> - read 
<a href="https://docs.gitlab.com/ee/user/permissions.html">https://docs.gitlab.com/ee/user/permissions.html</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org74eebb9" class="outline-2">
<h2 id="org74eebb9">Remote access</h2>
<div class="outline-text-2" id="text-org74eebb9">
<ul class="org-ul">
<li>Personal Access Token</li>
<li>SSH configuration</li>

<li><b>gitlab/User Setting</b> : 
<ul class="org-ul">
<li>Personal Access Token</li>
<li>SSH Key</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgf8ca322" class="outline-2">
<h2 id="orgf8ca322">FAQ</h2>
<div class="outline-text-2" id="text-orgf8ca322">
</div>
<div id="outline-container-orgcd1a485" class="outline-3">
<h3 id="orgcd1a485">Create static html and host in gitlab</h3>
<div class="outline-text-3" id="text-orgcd1a485">
</div>
<div id="outline-container-org50f12c8" class="outline-4">
<h4 id="org50f12c8">Install Gitlab Runner in local OS for gitlab project or group</h4>
<div class="outline-text-4" id="text-org50f12c8">
<p>
<a href="https://docs.gitlab.com/runner/install/">https://docs.gitlab.com/runner/install/</a>
</p>

<p>
<a href="https://www.youtube.com/watch?v=G8ZONHOTAQk">youtube link:</a>
</p>


<p>
Note: in project or github repo go Setting/ CI/CD/ Runner
install Runner 
</p>

<ul class="org-ul">
<li>Click Follow the to set up a runner. or</li>
<li>Click :</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh"># Download the binary for your system
sudo curl -L --output /usr/local/bin/gitlab-runner https://gitlab-runner-downloads.s3.amazonaws.com/latest/binaries/gitlab-runner-linux-amd64

# Give it permission to execute
sudo chmod +x /usr/local/bin/gitlab-runner

# Create a GitLab Runner user
sudo useradd --comment 'GitLab Runner' --create-home gitlab-runner --shell /bin/bash

# Install and run as a service
sudo gitlab-runner install --user=gitlab-runner --working-directory=/home/gitlab-runner
sudo gitlab-runner start

# Command to register runner
# NOTE : GITLAB will generate the token 
sudo gitlab-runner register --url https://gitlab.com/ --registration-token GR1348941AxBu37cTfuz9eH48gyD9 
</pre>
</div>
</div>
</div>
<div id="outline-container-org1e2bce4" class="outline-4">
<h4 id="org1e2bce4">Create static html page using gitlab</h4>
<div class="outline-text-4" id="text-org1e2bce4">
<p>
<a href="https://www.youtube.com/watch?v=kvZ9teaA5zI">https://www.youtube.com/watch?v=kvZ9teaA5zI</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org48e6b31" class="outline-3">
<h3 id="org48e6b31">how-to-change-the-project-owner-in-gitlab</h3>
<div class="outline-text-3" id="text-org48e6b31">
<p>
<a href="https://stackoverflow.com/questions/21579693/how-to-change-the-project-owner-in-gitlab">https://stackoverflow.com/questions/21579693/how-to-change-the-project-owner-in-gitlab</a>
</p>

<p>
Because one user cannot "own" another namespace (not even admins), the only option to set up a scenario where two users own the same namespace is with a group. Perform the following steps to accomplish this.
</p>

<ul class="org-ul">
<li>Create a new group.</li>
<li>Add the user that you want to transfer your project to as an owner member of that group.</li>
<li>Transfer your project to that group (a namespace you manage because you are an owner).</li>
<li>Login as the other user, then transfer the group project to the "other user" namespace.</li>
</ul>

<p>
At this point you will be left as a master in the project. You can now remove yourself from the project entirely if desired.
</p>
</div>
</div>
</div>




<div id="outline-container-orgf963325" class="outline-2">
<h2 id="orgf963325">NEXT [#A] GitLab Project Management: How to use Issue, Labels, and Boards</h2>
<div class="outline-text-2" id="text-orgf963325">
<p>
<a href="https://www.youtube.com/watch?v=J2u7OqBA_aQ">https://www.youtube.com/watch?v=J2u7OqBA_aQ</a>
GitLab Project Management: How to use Issue, Labels, and Boards
</p>
</div>
</div>

<div id="outline-container-org60667f5" class="outline-2">
<h2 id="org60667f5">Gitlab Issuse</h2>
<div class="outline-text-2" id="text-org60667f5">
<p>
<a href="https://www.youtube.com/watch?v=YshvUGgF_3o">https://www.youtube.com/watch?v=YshvUGgF_3o</a>
</p>

<p>
issuse template
<a href="https://www.youtube.com/watch?v=ObNWS3trqIY">https://www.youtube.com/watch?v=ObNWS3trqIY</a>
<a href="https://www.youtube.com/watch?v=UPsCXqxxJUA">https://www.youtube.com/watch?v=UPsCXqxxJUA</a>
</p>
</div>
</div>
<div id="outline-container-orgab56b43" class="outline-2">
<h2 id="orgab56b43">Gitlab Member Permissions : ower, maintainer, developer, reporter, guest</h2>
<div class="outline-text-2" id="text-orgab56b43">
<ul class="org-ul">
<li>access permission : owner, maintainer, developer, repoter, guest</li>
</ul>
</div>
</div>
<div id="outline-container-orgdd0cdd1" class="outline-2">
<h2 id="orgdd0cdd1">Gitlab Lables :</h2>
<div class="outline-text-2" id="text-orgdd0cdd1">
<p>
<a href="https://docs.gitlab.com/ee/user/project/labels.html">https://docs.gitlab.com/ee/user/project/labels.html</a>
</p>

<p>
Create a lable : <a href="https://www.youtube.com/watch?v=YshvUGgF_3o">Newbostan:Git Tutorial - 23 - GitHub Issues and Labels</a>
</p>

<p>
<a href="https://gitlab.com/gitlab-org/quality/triage-reports/-/labels?page=7">https://gitlab.com/gitlab-org/quality/triage-reports/-/labels?page=7</a>
Use scoped labels in GitLab 11.10 for custom fields and custom workflows
</p>


<p>
<a href="https://www.youtube.com/watch?v=4BCBby6du3c">Use scoped labels in GitLab 11.10 for custom fields and custom workflows</a>
This(Scope label) is only avaible for premium tire 
</p>

<p>
<a href="https://www.youtube.com/watch?v=35V2FJX4sAs">https://www.youtube.com/watch?v=35V2FJX4sAs</a>
Demo - Service Desk 
</p>
</div>

<div id="outline-container-org5ce02d7" class="outline-3">
<h3 id="org5ce02d7">Lable : priortiy label</h3>
<div class="outline-text-3" id="text-org5ce02d7">
<ul class="org-ul">
<li>Lable issue with priority</li>
<li>Standard Planing Board</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0a9d809" class="outline-2">
<h2 id="org0a9d809"></h2>
</div>
<div id="outline-container-org50dbe1d" class="outline-2">
<h2 id="org50dbe1d">Git</h2>
</div>
<div id="outline-container-orgcb01e67" class="outline-2">
<h2 id="orgcb01e67">Git Issuse Board</h2>
</div>

<div id="outline-container-orgcd689a2" class="outline-2">
<h2 id="orgcd689a2">Git Milestone</h2>
<div class="outline-text-2" id="text-orgcd689a2">
<p>
<a href="https://www.youtube.com/watch?v=ZBjCmOYNb5Q">https://www.youtube.com/watch?v=ZBjCmOYNb5Q</a>
Gitlab Project Management: Sprints, User Stories, and Tasks
</p>

<p>
<a href="https://www.youtube.com/watch?v=tv4UM1ruQRs">https://www.youtube.com/watch?v=tv4UM1ruQRs</a>
</p>

<p>
<a href="https://www.youtube.com/watch?v=enMumwvLAug">https://www.youtube.com/watch?v=enMumwvLAug</a>
Introduction to GitLab Workflow
</p>
</div>
</div>
<div id="outline-container-org72ffa75" class="outline-2">
<h2 id="org72ffa75"><span class="todo TODO">TODO</span> Gitlab jira intergration</h2>
<div class="outline-text-2" id="text-org72ffa75">
<p>
<a href="https://www.youtube.com/watch?v=p56zrZtrhQE">https://www.youtube.com/watch?v=p56zrZtrhQE</a>
</p>

<p>
GitLab-Jira Integration - Jira Automation Triggers
</p>

<p>
<a href="https://www.youtube.com/watch?v=DhAGIg04uaQ">https://www.youtube.com/watch?v=DhAGIg04uaQ</a>
</p>

<p>
GitLab-Jira Integration - Jira Deployments
<a href="https://www.youtube.com/watch?v=i_Gzxp8A2l4">https://www.youtube.com/watch?v=i_Gzxp8A2l4</a>
</p>
</div>
</div>

<div id="outline-container-org40c2d65" class="outline-2">
<h2 id="org40c2d65"><span class="todo TODO">TODO</span> Gitlab Issuse &lt;board&gt; kanban</h2>
<div class="outline-text-2" id="text-org40c2d65">
<p>
<a href="https://www.youtube.com/watch?v=CiolDtBIOA0">https://www.youtube.com/watch?v=CiolDtBIOA0</a>
 GitLab issue boards demo
</p>
</div>
</div>
